{
  "id": "028-2021",
  "title": "Serenade Foods Recalls Frozen Raw Breaded Stuffed Chicken Products due to Possible Salmonella Enteritidis Contamination",
  "url": "https://www.fsis.usda.gov/recalls-alerts/serenade-foods-recalls-frozen-raw-breaded-stuffed-chicken-products-due-possible",
  "reasons": [
    "Product Contamination"
  ],
  "status": "Closed",
  "risk_level": "High",
  "start_date": "2021-08-10",
  "end_date": "2021-11-18",
  "summary": "WASHINGTON, Aug. 9, 2021 – Serenade Foods, a Milford, Ind. establishment, is recalling approximately 59,251 pounds of frozen, raw, breaded and pre-browned stuffed chicken products that may be contaminated with Salmonella Enteritidis, the U.S. Department of Agriculture’s Food Safety and Inspection Service (FSIS) announced today...\n",
  "establishment": {
    "id": "M2375+P2375",
    "url": "http://www.fsis.usda.gov/inspection/fsis-inspected-establishments/serenade-foods-division-maple-leaf-farms-inc",
    "slug": "serenade-foods-division-maple-leaf-farms-inc",
    "name": "Serenade Foods, Division of Maple Leaf Farms, Inc.",
    "address": "9179 North 200 East \n  Milford, IN 46542",
    "telephone": "(574) 453-4500",
    "grant_date": "2021-10-28",
    "activities": [
      "Meat Processing",
      "Poultry Processing"
    ]
  },
  "impacted_products": [
    "5-oz individually plastic-wrapped packages of “Dutch Farms Chicken with Broccoli & Cheese” with lot code BR 1055 and BEST IF USED BY FEB 24 2023",
    "5-oz individually plastic-wrapped packages of “MILFORD VALLEY CHICKEN WTH BROCCOLI & CHEESE” with lot code BR 1055 and BEST IF USED BY FEB 24 2023",
    "10-oz box of two individually plastic-wrapped packages of “MILFORD VALLEY CHICKEN CORDON BLEU” with lot code CB 1055 and BEST IF USED BY FEB 24 2023.",
    "5-oz individually plastic-wrapped packages of “KIRKWOOD Raw Stuffed CHICKEN, BROCCOLI & CHEESE” with lot code BR 1055 and BEST IF USED BY FEB 24 2023.",
    "5-oz individually plastic-wrapped packages of “KIRKWOOD Raw Stuffed CHICKEN CORDON BLEU” with lot code CB 1056 and BEST IF USED BY FEB 25 2023."
  ],
  "quantity_recovered": 24806,
  "quantity_unit": "pounds",
  "states": null
}