{"id": "046-2019", "title": "Denver Processing LLC Recalls Raw Pork and Beef Products Produced Without Benefit of Inspection", "url": "https://www.fsis.usda.gov/recalls-alerts/denver-processing-llc-recalls-raw-pork-and-beef-products-produced-without-benefit", "reasons": ["Produced Without Benefit of Inspection"], "status": "Closed", "risk_level": "High", "start_date": "2019-04-12", "end_date": null, "summary": "WASHINGTON, April 12, 2019 Denver Processing LLC, a Denver, Colo. establishment, is recalling approximately 13,865 pounds of raw pork and beef products that were produced without the benefit of federal inspection and outside inspection hours, the U.S. Department of Agricultures Food Safety and Inspection Service...\n", "establishment": {"id": "M6250+P6250+V6250", "url": "http://www.fsis.usda.gov/inspection/fsis-inspected-establishments/jbs-usa", "slug": "jbs-usa", "name": "JBS USA", "address": "65 Yuma Street \n  Denver, CO 80223", "telephone": "(303) 778-3128", "grant_date": "2015-03-24", "activities": ["Meat Processing", "Poultry Processing"]}, "impacted_products": ["Varying catch weight plastic wrapped trays containing “Pork Sirloin Boneless Chop” with “Sell By 04.18.19,” lot code 099, case code 60047, and all time stamps after 14:30. ", "Varying catch weight plastic wrapped trays containing “Pork Boneless Loin Top Loin Roast” with “Sell By 04.18.19,” lot code 099, case code 60105, and all time stamps after 14:30. ", "Varying catch weight plastic wrapped trays containing “Diced Pork Super Value Pack” with “Sell By 04.18.19,” lot code 099, case code 06385, and all time stamps after 14:30. ", "Varying catch weight plastic wrapped trays containing “Pork Loin Boneless Chop” with “Sell By 04.18.19,” lot code 099, case code 60063, and all time stamps after 14:30. ", "Varying catch weight plastic wrapped trays containing “Pork Loin Boneless Chops Family Pack” with “Sell By 04.18.19,” lot code 099, case code 19498, and all time stamps after 14:30. ", "Varying catch weight plastic wrapped trays containing “U.S.D.A. Choice Beef Chuck Pot Roast Boneless” with sell by date “0418,” lot code 099, case code 69481, and all time stamps after 14:30. ", "Varying catch weight plastic wrapped trays containing “U.S.D.A. Choice Beef Top Round London Broil” with sell by date “0418,” lot code 099, case code 69479, and all time stamps after 14:30. "], "quantity_recovered": 0, "quantity_unit": "pounds", "states": ["Colorado", "Kansas", "New Mexico", "Utah", "Wyoming"]}
