{"id": "104-2017", "title": "Prestage Foods, Inc. Recalls Turkey Products Due To Possible Extraneous Material Contamination", "url": "https://www.fsis.usda.gov/recalls-alerts/prestage-foods-inc.-recalls-turkey-products-due-possible-extraneous-material", "reasons": ["Product Contamination"], "status": "Closed", "risk_level": "Low", "start_date": "2017-10-02", "end_date": null, "summary": "WASHINGTON, Oct. 2, 2017 Prestage Foods, Inc., a St. Pauls, N.C. establishment, is recalling approximately 38,475 pounds of ground turkey that may be contaminated with extraneous materials, the U.S. Department of Agricultures Food Safety and Inspection Service (FSIS) announced today. The fresh ground turkey was...", "establishment": null, "impacted_products": ["•1.3-lb. White Styrofoam trays with clear plastic film covering packages containing ground turkey labeled “Publix ground turkey breast WITH NATURAL FLAVORINGS” with ink jet printing on the side of trays displaying the first 4 digits of 7268 and 7269.", "•1.3-lb. White Styrofoam trays with clear plastic film covering packages containing ground turkey labeled “Publix ground turkey WITH NATURAL FLAVORINGS” with ink jet labeling on the side of trays displaying the first 4 digits of 7268 and 7269.", "•1.2-lb. White Styrofoam trays with clear plastic film covering packages containing ground turkey labeled “Fit & Active Fresh Ground Turkey With Natural Flavoring” with ink jet labeling on the side of trays displaying the first 4 digits of 7268 and 7269.", "•1.0-lb. White Styrofoam trays with clear plastic film covering packages containing ground turkey labeled “Weis Markets Fresh Ground Turkey Breast” with ink jet labeling on the side of trays displaying the first 4 digits of 7268 and 7269."], "quantity_recovered": 38475, "quantity_unit": "pounds", "states": ["Alabama", "Connecticut", "Florida", "Georgia", "New York", "North Carolina", "Pennsylvania", "South Carolina", "Tennessee"]}
