{
  "id": "024-2025",
  "title": "Gaiser's European Style Provisions Inc. Recalls Ready-To-Eat Meat and Poultry Bologna Products Due to Misbranding ",
  "url": "https://www.fsis.usda.gov/recalls-alerts/gaisers-european-style-provisions-inc--recalls-ready-eat-meat-and-poultry-bologna",
  "reasons": [
    "Misbranding"
  ],
  "status": "Closed",
  "risk_level": "Marginal",
  "start_date": "2025-06-27",
  "end_date": "2025-09-04",
  "summary": " WASHINGTON, June 27, 2025 – Gaiser's European Style Provisions Inc., a Union, N.J., establishment, is recalling approximately 143,416 pounds of ready-to-eat bologna due to misbranding, the U.S. Department of Agriculture’s Food Safety and Inspection Service (FSIS) announced today. The various bologna products subject to recall...\n",
  "establishment": {
    "id": "M5385+P5385",
    "url": "http://www.fsis.usda.gov/inspection/fsis-inspected-establishments/gaisers-european-style-provisions-inc.",
    "slug": "gaisers-european-style-provisions-inc",
    "name": "Gaiser's European Style Provisions Inc.",
    "address": "2019 Morris Avenue \n  Union, NJ\n     07083",
    "telephone": "(908) 686-3421",
    "grant_date": "2021-08-11",
    "activities": [
      "Meat Processing;  Poultry Processing"
    ]
  },
  "impacted_products": [
    " • Vacuum-packed packages of “FAMILY TREE BOLOGNA VEAL” containing undeclared pork.",
    " • Plastic-wrapped packages of “BABUSHKA’S RECIPE CHICKEN BOLOGNA” containing undeclared pork.",
    "• Plastic-wrapped packages of “FANCY BOLOGNA” labeled with pork as an ingredient but containing undeclared beef and chicken.",
    "• Vacuum-packed packages of “GAISERS RUSSIAN BRAND DOKTORSKAYA BOLOGNA” containing undeclared beef.",
    "• Plastic-wrapped packages of “GAISERS BOLOGNA VEAL” containing undeclared chicken and pork.",
    "• Plastic-wrapped packages of “GAISERS TURKEY BOLOGNA” containing undeclared chicken and pork.",
    "• Plastic-wrapped packages of “CHICKEN BOLOGNA KYPOYKA PABA” containing undeclared pork."
  ],
  "quantity_recovered": 12030,
  "quantity_unit": "lbs",
  "states": [
    "Nationwide"
  ]
}