{
  "id": "029-2025",
  "title": "Quality Poultry & Seafood, Inc. Recalls Various Catfish Fillet Products Produced Without Benefit of Inspection ",
  "url": "https://www.fsis.usda.gov/recalls-alerts/quality-poultry-seafood-inc--recalls-various-catfish-fillet-products-produced",
  "reasons": [
    "Produced Without Benefit of Inspection"
  ],
  "status": "Active",
  "risk_level": "High",
  "start_date": "2025-09-15",
  "end_date": null,
  "summary": " Editor’s Note: Details of this recall were updated on September 16, 2025, to reflect an additional recalled product and corresponding labels. WASHINGTON, September 15, 2025 – Quality Poultry & Seafood, Inc., a Biloxi, Miss., establishment, is recalling approximately 98,916 pounds of catfish fillet products that...\n",
  "establishment": {
    "id": "M47344+P47344",
    "url": "http://www.fsis.usda.gov/inspection/fsis-inspected-establishments/quality-poultry-seafood-inc.",
    "slug": "quality-poultry-seafood-inc",
    "name": "Quality Poultry & Seafood, Inc.",
    "address": "895 Division Street \n  Biloxi, MS\n     39530",
    "telephone": "(228) 432-5216",
    "grant_date": "2025-08-29",
    "activities": [
      "Meat Processing;  Poultry Processing"
    ]
  },
  "impacted_products": [
    "•\tTranslucent plastic bag packages containing various pieces of frozen catfish fillet products labeled “VARIED CATFISH MISCUT FILLETS, FARMED RAISED CATFISH PRODUCT OF USA”, and Net Wt. 5#.",
    "•\tCardboard boxes containing three translucent plastic bag packages containing various pieces of frozen catfish fillet products labeled “VARIED CATFISH MISCUT FILLETS, FARMED RAISED CATFISH PRODUCT OF USA”, and Net Wt. 15#.",
    "•\tTranslucent plastic bag packages containing various pieces of frozen catfish fillet products labeled “IRREGULAR CATFISH SHANK FILLET, FARMED RAISED CATFISH PRODUCT OF USA”, and Net Wt. 5#.",
    "•\tTranslucent plastic bag packages containing various pieces of frozen catfish fillet products labeled “IRREGULAR CATFISH RANDOM FILLET, FARMED RAISED CATFISH PRODUCT OF USA”, and Net Wt. 5#.",
    "•\tCardboard boxes containing three translucent plastic bag packages containing various catfish fillet products labeled “IRREGULAR CATFISH RANDOM FILLET, FARMED RAISED CATFISH PRODUCT OF USA”, and Net Wt. 15#."
  ],
  "quantity_recovered": null,
  "quantity_unit": null,
  "states": [
    "Louisiana"
  ]
}