{
  "id": "PHA-05012025-002",
  "title": "FSIS Issues Public Health Alert for Ineligible Pork Cracklings Products Imported From the Republic of Colombia",
  "url": "https://www.fsis.usda.gov/recalls-alerts/fsis-issues-public-health-alert-ineligible-pork-cracklings-products-imported",
  "reasons": [
    "Import Violation"
  ],
  "status": "Active",
  "risk_level": null,
  "start_date": "2025-05-01",
  "end_date": null,
  "summary": " WASHINGTON, May 1, 2025 – The U.S. Department of Agriculture’s Food Safety and Inspection Service (FSIS) is issuing a public health alert for potato chip products containing chicharrón (pork cracklings) that were imported from the Republic of Colombia. Colombia is ineligible to export meat products...\n",
  "establishment": null,
  "impacted_products": [
    "•\t270-g. plastic bag containing six 45-g. foil bags of “De Todito NATURAL” mixed chips with “CHICHARRÓN AMERICANO JACKS,” “Margarita,” and “NATU CHIPS.”",
    "•\t165-g. foil bags containing “De Todito NATURAL” mixed chips with “CHICHARRÓN AMERICANO JACKS,” “Margarita,” and “NATU CHIPS.”",
    "•\t270-g. plastic bag containing six 45-g. foil bags of “De Todito BBQ” mixed chips with “CHICHARRÓN AMERICANO JACKS,” “Margarita,” and “NatuChips.”",
    "•\t165-g. foil bags containing “De Todito BBQ” mixed chips with “CHICHARRÓN AMERICANO JACKS,” “Margarita,” and “NatuChips.”",
    "•\t165-g. foil bags containing “De Todito LIMÓN” mixed chips with “CHICHARRÓN AMERICANO JACKS,” “Margarita,” “TOSTITOS,” and “NATU CHIPS.”",
    "•\t270-g. plastic bag containing six 45-g. foil bags of “De Todito LIMÓN” mixed chips with “CHICHARRÓN AMERICANO JACKS,” “Margarita,” “TOSTITOS,” and “NATU CHIPS.”",
    "•\t140-g. foil bags containing “GOLPE CON TODO SABOR LIMÓN” mixed chips with “RIZADAS,” “PLÁTANOS,” and “Chicharrón Fred.”"
  ],
  "quantity_recovered": null,
  "quantity_unit": null,
  "states": [
    "Nationwide"
  ]
}