{
  "id": "PHA-04272022-01",
  "title": "FSIS Issues Public Health Alert for Ground Beef Products  Due to Possible E. coli O26 Contamination",
  "url": "https://www.fsis.usda.gov/recalls-alerts/fsis-issues-public-health-alert-ground-beef-products-due-possible-e-coli-o26",
  "reasons": [
    "Product Contamination"
  ],
  "status": "Active",
  "risk_level": null,
  "start_date": "2022-04-27",
  "end_date": null,
  "summary": "WASHINGTON April 27, 2022, – The U.S. Department of Agriculture’s Food Safety and Inspection Service (FSIS) is issuing a public health alert due to concerns that specific ground beef products may be adulterated with E. coli O26. A recall was not requested because the products...\n",
  "establishment": null,
  "impacted_products": [
    "•\t1-lb. foam trays containing “ALL NATURAL LAURA’S LEAN BEEF 92% LEAN 8% FAT GROUND BEEF.” The product is labeled with 350/(timestamp)/Est.31805/002, with the timestamp ranging from 0602 to 1721.",
    "•\t1-lb. foam trays containing “Kroger GROUND BEEF CARNE MOLIDA 96% LEAN 4% FAT.” The product is labeled with 350/(timestamp)/Est.31805/002, with the timestamp ranging from 0602 to 1721.",
    "•\t1-lb. foam trays containing “Kroger GROUND BEEF CARNE MOLIDA 85% LEAN 15% FAT.” The product is labeled with 350/(timestamp)/Est.31805/002, with the timestamp ranging from 0602 to 1721.",
    "•\t1.3-lb. foam trays containing “PRIVATE SELECTION ANGUS BEEF 90% LEAN 10% FAT GROUND SIRLOIN.” The product is labeled with 350/(timestamp)/Est.31805/002, with the timestamp ranging from 0602 to 1721. Additional product is labeled with 351/(timestamp)/Est",
    "•\t1-lb. foam trays containing “Kroger GROUND BEEF CARNE MOLIDA 93% LEAN 7% FAT.” The product is labeled with 350/(timestamp)/Est.31805/002, with the timestamp ranging from 0602 to 1721.",
    "•\t1-lb. foam trays containing “Kroger GROUND BEEF CARNE MOLIDA 80% LEAN 20% FAT.” The product is labeled with 350/(timestamp)/Est.31805/002, with the timestamp ranging from 0602 to 1721."
  ],
  "quantity_recovered": null,
  "quantity_unit": null,
  "states": null
}